k6/cache-result/cache-test-local-vs-none.txt

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: cache-test-local-vs-none.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


     ✓ v1 전체 조회 200
     ✓ v2 전체 조회 200
     ✓ v1 조건 검색 200
     ✓ v2 조건 검색 200

     checks.........................: 100.00% 3000 out of 3000
     data_received..................: 1.3 MB  43 kB/s
     data_sent......................: 477 kB  16 kB/s
     http_req_blocked...............: avg=34.62µs  min=0s    med=2µs    max=2.7ms    p(90)=5µs     p(95)=9µs
     http_req_connecting............: avg=17.68µs  min=0s    med=0s     max=1.38ms   p(90)=0s      p(95)=0s
     http_req_duration..............: avg=13.12ms  min=395µs med=4.31ms max=405.13ms p(90)=13.71ms p(95)=27.26ms
       { expected_response:true }...: avg=13.12ms  min=395µs med=4.31ms max=405.13ms p(90)=13.71ms p(95)=27.26ms
     http_req_failed................: 0.00%   0 out of 3000
     http_req_receiving.............: avg=220.94µs min=5µs   med=26µs   max=17.32ms  p(90)=240µs   p(95)=582.89µs
     http_req_sending...............: avg=17.26µs  min=1µs   med=6µs    max=5.29ms   p(90)=16µs    p(95)=29µs
     http_req_tls_handshaking.......: avg=0s       min=0s    med=0s     max=0s       p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=12.88ms  min=361µs med=4.16ms max=404.95ms p(90)=13ms    p(95)=26.24ms
     http_reqs......................: 3000    97.318016/s
     iteration_duration.............: avg=2.05s    min=2s    med=2.02s  max=2.5s     p(90)=2.05s   p(95)=2.47s
     iterations.....................: 750     24.329504/s
     vus............................: 50      min=50           max=50
     vus_max........................: 50      min=50           max=50


running (0m30.8s), 00/50 VUs, 750 complete and 0 interrupted iterations
default ✓ [======================================] 50 VUs  30s